{
    "name": "Mikhail Tal",
    "description": "A fiercely aggressive and tactical genius, known for spectacular sacrifices and relentless attacks.",
    "Elo_Note": "Suggested Elo: 2799",
    "PersonalityBook": true,
    "BookFile": "books/tal.bin",
    "BookWidth": 12,
    "BookDepth": 18,
    "evaluation": {
        "Aggressiveness": 30,
        "RiskTaking": 30,
        "KingSafety": 15,
        "PieceActivity": 35,
        "PawnStructure": 20,
        "KnightPair": 40,
        "BishopPair": 42,
        "Defense": 5,
        "CalculationDepth": 9,
        "EndgameKnowledge": 30,
        "PieceSacrifice": 30,
        "CenterControl": 35,
        "PositionClosure": 15,
        "PieceTrade": 10,
        "KingAttack": 40,
        "PositionalSacrifice": 20,
        "KnightVsBishop": 20,
        "PawnPush": 25,
        "OpenFileControl": 30,
        "RookActivity": 30,
        "PawnStorm": 35,
        "SacrificeFrequency": 40,
        "KingMobility": 15,
        "PieceCoordination": 25,
        "HumanImperfection": 28
    },
    "explanation": {
        "Aggressiveness": "Tal was one of the most aggressive players ever. This ensures a relentless attacking style.",
        "RiskTaking": "He loved chaotic and sharp positions, often taking extreme risks.",
        "KingSafety": "Tal often ignored his own king's safety to launch attacks, leading to bold sacrifices.",
        "PieceActivity": "His pieces were always dynamically placed to maximize tactical opportunities.",
        "PawnStructure": "Tal prioritized piece activity over a solid pawn structure, preferring dynamic play.",
        "KnightPair": "He frequently used knights in his sacrifices and tactical shots.",
        "BishopPair": "Tal valued bishops highly in attacking play, often using them in sacrifices.",
        "Defense": "His defense was secondary to attack. A lower value makes his style ultra-aggressive.",
        "CalculationDepth": "Tal relied on intuition but had deep tactical foresight.",
        "EndgameKnowledge": "His main strength was the middlegame, but he had good endgame skills as well.",
        "PieceSacrifice": "Tal's signature trait—always seeking sacrifices for dynamic advantages.",
        "CenterControl": "Tal controlled the center aggressively to launch his attacks.",
        "PositionClosure": "A moderate value allows a balance between open and closed positions.",
        "PieceTrade": "Tal rarely traded pieces unless it helped his attack.",
        "KingAttack": "A very high value ensures he constantly looks for attacking possibilities.",
        "PositionalSacrifice": "He sometimes sacrificed material for long-term positional advantages.",
        "KnightVsBishop": "A slight preference for knights, as he often used them in tactical play.",
        "PawnPush": "Tal frequently pushed pawns to create attacking chances.",
        "OpenFileControl": "He actively used open files to increase piece activity.",
        "RookActivity": "Tal used his rooks actively on open files to support dynamic attacks.",
        "PawnStorm": "Tal often launched aggressive pawn storms against the opponent's king.",
        "SacrificeFrequency": "Tal frequently sacrificed material to create tactical chances.",
        "KingMobility": "He was not afraid to move his king actively, especially in the endgame.",
        "PieceCoordination": "His pieces worked together to maximize tactical opportunities.",
        "HumanImperfection": "Tal unpredictable style led to brilliant moves but also creative mistakes. A higher value allows for occasional errors, simulating his fearless play."
    },
    "loss_streak": 0
}
