{
    "name": "Magnus Carlsen",
    "description": "A universal and highly resilient player, known for deep positional play, endgame mastery, and relentless pressure.",
    "Elo_Note": "Suggested Elo: 2833",
    "PersonalityBook": true,
    "BookFile": "books/carlsen.bin",
    "BookWidth": 10,
    "BookDepth": 18,
    "evaluation": {
        "Aggressiveness": 24,
        "RiskTaking": 22,
        "KingSafety": 30,
        "PieceActivity": 40,
        "PawnStructure": 35,
        "KnightPair": 30,
        "BishopPair": 30,
        "Defense": 25,
        "CalculationDepth": 18,
        "EndgameKnowledge": 50,
        "PieceSacrifice": 18,
        "CenterControl": 48,
        "PositionClosure": 38,
        "PieceTrade": 25,
        "KingAttack": 20,
        "PositionalSacrifice": 10,
        "KnightVsBishop": 0,
        "PawnPush": 30,
        "OpenFileControl": 35,
        "RookActivity": 40,
        "PawnStorm": 20,
        "SacrificeFrequency": 15,
        "KingMobility": 30,
        "PieceCoordination": 50,
        "HumanImperfection": 10
    },
    "explanation": {
        "Aggressiveness": "Carlsen is not overly aggressive but exerts constant pressure on opponents.",
        "RiskTaking": "He takes calculated risks rather than speculative ones.",
        "KingSafety": "Always ensures his king is safe, avoiding unnecessary exposure.",
        "PieceActivity": "His pieces are well-coordinated and placed optimally.",
        "PawnStructure": "Carlsen maintains strong pawn structures to support strategic play.",
        "KnightPair": "He values knights for maneuvering but does not favor them over bishops.",
        "BishopPair": "He uses bishops effectively but does not overly rely on them.",
        "Defense": "Carlsen is extremely solid and rarely blunders.",
        "CalculationDepth": "His calculations are deep and precise.",
        "EndgameKnowledge": "His endgame mastery is among the best in history.",
        "PieceSacrifice": "He sacrifices pieces only when it provides a clear strategic or tactical advantage.",
        "CenterControl": "Controls the center with strong positional understanding.",
        "PositionClosure": "Comfortable in both open and closed positions, adapting as needed.",
        "PieceTrade": "Trades pieces efficiently to reach favorable endgames.",
        "KingAttack": "Attacks only when strategically justified.",
        "PositionalSacrifice": "Occasionally sacrifices material for long-term positional gain.",
        "KnightVsBishop": "Neutral preference, adapting to the position.",
        "PawnPush": "Pushes pawns carefully, improving position without unnecessary weaknesses.",
        "OpenFileControl": "Uses open files effectively for piece coordination.",
        "RookActivity": "Carlsen places his rooks efficiently on open files, maximizing their potential.",
        "PawnStorm": "Rarely engages in aggressive pawn storms, preferring positional buildup.",
        "SacrificeFrequency": "He sacrifices very rarely, only when the position demands it.",
        "KingMobility": "Carlsen knows when to activate his king in the endgame for maximum efficiency.",
        "PieceCoordination": "His pieces work together harmoniously, ensuring optimal positioning.",
        "HumanImperfection": "Carlsen makes very few mistakes, playing nearly error-free chess."
    },
    "loss_streak": 0
}