{
    "name": "Bobby Fischer",
    "description": "A dominant and well-prepared player, known for deep opening preparation, precise calculation, and universal playing style.",
    "Elo_Note": "Suggested Elo: 2895",
    "PersonalityBook": true,
    "BookFile": "books/fischer.bin",
    "BookWidth": 10,
    "BookDepth": 16,
    "evaluation": {
        "Aggressiveness": 20,
        "RiskTaking": 15,
        "KingSafety": 50,
        "PieceActivity": 40,
        "PawnStructure": 60,
        "KnightPair": 35,
        "BishopPair": 45,
        "Defense": 40,
        "CalculationDepth": 14,
        "EndgameKnowledge": 55,
        "PieceSacrifice": 15,
        "CenterControl": 50,
        "PositionClosure": 35,
        "PieceTrade": 30,
        "KingAttack": 20,
        "Profilaxis": 40,
        "PositionalSacrifice": 15,
        "KnightVsBishop": 10,
        "PawnPush": 25,
        "OpenFileControl": 35
    },
    "explanation": {
        "Aggressiveness": "Fischer played with a controlled and principled aggression, focusing on strong positions rather than reckless attacks.",
        "RiskTaking": "He preferred clear advantages and avoided unnecessary complications, making his play highly efficient.",
        "KingSafety": "Fischer prioritized a solid king position, ensuring strong middlegame and endgame resilience.",
        "PieceActivity": "His pieces were always well-coordinated, placed for maximum effectiveness in both attack and defense.",
        "PawnStructure": "Fischer valued strong, classical pawn structures, avoiding unnecessary weaknesses.",
        "KnightPair": "He used knights effectively but preferred dynamic piece play rather than closed maneuvering.",
        "BishopPair": "He frequently utilized the bishop pair to exert long-term positional pressure.",
        "Defense": "Fischer was difficult to crack defensively, responding precisely to threats while maintaining counterplay.",
        "CalculationDepth": "His calculation was razor-sharp, allowing him to execute deep strategic and tactical plans.",
        "EndgameKnowledge": "He was an exceptional endgame player, converting small advantages with extreme precision.",
        "PieceSacrifice": "Sacrifices were only played when fully justified by clear positional or tactical gains.",
        "CenterControl": "Fischer fought fiercely for central control, ensuring stable dominance over the board.",
        "PositionClosure": "He adapted to both open and closed positions, favoring structural flexibility.",
        "PieceTrade": "He exchanged pieces strategically, often simplifying to an endgame where he excelled.",
        "KingAttack": "While capable of brilliant attacks, Fischer preferred methodical, positionally justified aggression.",
        "Profilaxis": "His deep understanding of chess allowed him to anticipate and neutralize opponent plans effortlessly.",
        "PositionalSacrifice": "He occasionally sacrificed material for long-term positional advantages, but only when fully justified.",
        "KnightVsBishop": "He had no fixed preference between knights and bishops, using each according to the demands of the position.",
        "PawnPush": "Fischer's pawn pushes were well-timed and effective, creating lasting positional advantages.",
        "OpenFileControl": "His rooks were always optimally placed, seizing open files and key points on the board."
    },
    "loss_streak": 0
}
