{
    "name": "Alexander Alekhine",
    "description": "A brilliant and strategic attacker, known for deep planning and spectacular combinations.",
    "Elo_Note": "Suggested Elo: 2860",
    "PersonalityBook": true,
    "BookFile": "books/alekhine.bin",
    "BookWidth": 10,
    "BookDepth": 18,
    "evaluation": {
        "Aggressiveness": 30,
        "RiskTaking": 28,
        "KingSafety": 10,
        "PieceActivity": 35,
        "PawnStructure": 25,
        "KnightPair": 30,
        "BishopPair": 35,
        "Defense": 15,
        "CalculationDepth": 15,
        "EndgameKnowledge": 45,
        "PieceSacrifice": 30,
        "CenterControl": 40,
        "PositionClosure": 15,
        "PieceTrade": 18,
        "KingAttack": 35,
        "Profilaxis": 10,
        "PositionalSacrifice": 20,
        "KnightVsBishop": -10,
        "PawnPush": 30,
        "OpenFileControl": 35
    },
    "explanation": {
        "Aggressiveness": "Alekhine was a relentless attacker, always seeking dynamic and tactical opportunities.",
        "RiskTaking": "He often entered complex and unclear positions, favoring sharp play over cautious maneuvers.",
        "KingSafety": "While Alekhine prioritized the initiative, he sometimes left his king vulnerable to counterplay.",
        "PieceActivity": "His piece coordination was exceptional, ensuring dynamic movement and strong positioning.",
        "PawnStructure": "He valued dynamic play over rigid structures, often making pawn sacrifices for activity.",
        "KnightPair": "Though skilled with knights, he favored their use in combination rather than as a primary weapon.",
        "BishopPair": "His bishops were powerful attacking tools, frequently used in dynamic, open positions.",
        "Defense": "Alekhine preferred counterplay rather than passive defense, looking for tactical resources in difficult positions.",
        "CalculationDepth": "He saw deeply into combinations, planning several moves ahead with tactical precision.",
        "EndgameKnowledge": "While an exceptional middlegame player, his endgame was also well-developed and effective.",
        "PieceSacrifice": "He often sacrificed material to gain initiative, creating powerful attacking chances.",
        "CenterControl": "Alekhine fought aggressively for central control, ensuring his pieces dominated key squares.",
        "PositionClosure": "He preferred open positions to maximize activity, avoiding locked pawn structures.",
        "PieceTrade": "Alekhine avoided early exchanges, maintaining tension and building attacking chances.",
        "KingAttack": "His games were filled with spectacular king attacks, often leading to brilliant finishes.",
        "Profilaxis": "Rather than preventing opponent plans, he relied on creating overwhelming counterplay.",
        "PositionalSacrifice": "Material was often secondary to long-term strategic advantages in his play.",
        "KnightVsBishop": "He favored bishops in open positions but effectively used knights when the position required.",
        "PawnPush": "Pawn advances were a key part of his strategy, opening lines and creating imbalances.",
        "OpenFileControl": "His rooks were highly active, quickly occupying open files to support attacks."
    },
    "loss_streak": 0
}
