{
    "name": "Mikhail Botvinnik",
    "description": "A strategic and well-prepared player, known for deep opening preparation and strong positional play.",
    "Elo_Note": "Suggested Elo: 2885",
    "PersonalityBook": true,
    "BookFile": "books/botvinnik.bin",
    "BookWidth": 10,
    "BookDepth": 16,
    "evaluation": {
        "Aggressiveness": 20,
        "RiskTaking": 15,
        "KingSafety": 50,
        "PieceActivity": 40,
        "PawnStructure": 60,
        "KnightPair": 35,
        "BishopPair": 45,
        "Defense": 40,
        "CalculationDepth": 14,
        "EndgameKnowledge": 55,
        "PieceSacrifice": 15,
        "CenterControl": 50,
        "PositionClosure": 35,
        "PieceTrade": 30,
        "KingAttack": 20,
        "Profilaxis": 40,
        "PositionalSacrifice": 15,
        "KnightVsBishop": 10,
        "PawnPush": 25,
        "OpenFileControl": 35
    },
    "explanation": {
        "Aggressiveness": "Botvinnik played in a controlled, strategic manner, focusing on solid plans rather than reckless attacks.",
        "RiskTaking": "He avoided unnecessary risks, preferring well-calculated strategies with minimal weaknesses.",
        "KingSafety": "Ensuring king safety was crucial to his structured and methodical approach to the game.",
        "PieceActivity": "His pieces were placed for long-term strategic gains rather than immediate aggression.",
        "PawnStructure": "Botvinnik valued strong pawn structures, favoring stable formations over dynamic imbalances.",
        "KnightPair": "He maneuvered knights effectively, but they were not the primary focus of his play.",
        "BishopPair": "Bishops played a crucial role in his deep strategic planning and positional play.",
        "Defense": "His defensive play was precise, aiming to neutralize threats while maintaining control.",
        "CalculationDepth": "He calculated deeply, ensuring his moves fit into long-term strategic plans.",
        "EndgameKnowledge": "Botvinnik excelled in the endgame, where his technical skills and planning shined.",
        "PieceSacrifice": "Sacrifices were used sparingly and only when they fit into his deep strategic approach.",
        "CenterControl": "He prioritized strong central control, ensuring superior positioning for his pieces.",
        "PositionClosure": "He was flexible, closing positions when necessary to limit counterplay.",
        "PieceTrade": "Trades were considered carefully, favoring exchanges that simplified to advantageous positions.",
        "KingAttack": "He rarely sought direct king attacks, preferring to dominate positionally.",
        "Profilaxis": "He was excellent at anticipating opponent plans and neutralizing them before they became threats.",
        "PositionalSacrifice": "Sacrifices were used mainly for long-term strategic purposes rather than immediate attacks.",
        "KnightVsBishop": "He valued both knights and bishops, using them according to the needs of the position.",
        "PawnPush": "He advanced pawns with purpose, ensuring structural soundness and space control.",
        "OpenFileControl": "He controlled open files effectively, placing rooks where they could exert long-term influence."
    },
    "loss_streak": 0
}
