{
    "name": "Jose Capablanca",
    "description": "A positional and strategic genius, known for effortless precision and flawless endgame technique.",
    "Elo_Note": "Suggested Elo: 2877",
    "PersonalityBook": true,
    "BookFile": "books/capablanca.bin",
    "BookWidth": 7,
    "BookDepth": 13,
    "evaluation": {
        "Aggressiveness": 22,
        "RiskTaking": 14,
        "KingSafety": 35,
        "PieceActivity": 38,
        "PawnStructure": 50,
        "KnightPair": 30,
        "BishopPair": 45,
        "Defense": 55,
        "CalculationDepth": 20,
        "EndgameKnowledge": 55,
        "PieceSacrifice": 8,
        "CenterControl": 45,
        "PositionClosure": 30,
        "PieceTrade": 40,
        "KingAttack": 25,
        "PositionalSacrifice": 8,
        "KnightVsBishop": -25,
        "PawnPush": 18,
        "OpenFileControl": 40,
        "RookActivity": 45,
        "PawnStorm": 20,
        "SacrificeFrequency": 5,
        "KingMobility": 35,
        "PieceCoordination": 55,
        "HumanImperfection": 6
    },
    "explanation": {
        "Aggressiveness": "Capablanca was a calm and precise player, preferring strategic advantages over direct attacks.",
        "RiskTaking": "He avoided unnecessary risks, relying on deep positional understanding.",
        "KingSafety": "Capablanca rarely exposed his king unnecessarily, always ensuring its safety.",
        "PieceActivity": "He placed his pieces optimally but did not seek hyperactivity.",
        "PawnStructure": "He played with a clean, well-structured pawn game, ensuring long-term advantages.",
        "KnightPair": "Knights were useful to him, but he didn't rely on them heavily.",
        "BishopPair": "Bishops played a key role in his precise positional style.",
        "Defense": "He was extremely solid, hard to beat, and rarely made blunders.",
        "CalculationDepth": "Capablanca's calculation was deep and precise, allowing him to outplay opponents with accuracy.",
        "EndgameKnowledge": "His endgame technique was nearly perfect, making him one of the greatest in history.",
        "PieceSacrifice": "Unlike Tal, he rarely sacrificed material unless it guaranteed a clear advantage.",
        "CenterControl": "Capablanca always controlled the center with impeccable precision.",
        "PositionClosure": "He often played closed positions to outmaneuver opponents positionally.",
        "PieceTrade": "He excelled at exchanging pieces at the right moment to enter winning endgames.",
        "KingAttack": "Unlike Tal, Capablanca attacked only when completely justified.",
        "PositionalSacrifice": "Sacrifices were rare, but he used them occasionally for positional advantages.",
        "KnightVsBishop": "He clearly preferred bishops over knights due to their long-range power.",
        "PawnPush": "He advanced pawns carefully, favoring long-term positional benefits.",
        "OpenFileControl": "He expertly utilized open files for his rooks to maximize control.",
        "RookActivity": "His rooks were always well-placed, often dominating open files.",
        "PawnStorm": "Capablanca rarely used pawn storms, preferring strategic maneuvering.",
        "SacrificeFrequency": "Sacrifices were extremely rare, occurring only in clear positional gains.",
        "KingMobility": "He activated his king at the right moments, especially in endgames.",
        "PieceCoordination": "His pieces worked together in a perfect strategic harmony.",
        "HumanImperfection": "Capablanca's precision made him nearly flawless, but he still made occasional inaccuracies."
    },
    "loss_streak": 0
}