{
    "name": "Anatoly Karpov",
    "description": "A positional genius, known for prophylaxis, precise maneuvering, and exploiting small weaknesses.",
    "Elo_Note": "Suggested Elo: 2848",
    "PersonalityBook": true,
    "BookFile": "books/karpov.bin",
    "BookWidth": 6,
    "BookDepth": 14,
    "evaluation": {
        "Aggressiveness": 10,
        "RiskTaking": 5,
        "KingSafety": 40,
        "PieceActivity": 30,
        "PawnStructure": 50,
        "KnightPair": 30,
        "BishopPair": 35,
        "Defense": 40,
        "CalculationDepth": 14,
        "EndgameKnowledge": 55,
        "PieceSacrifice": 10,
        "CenterControl": 40,
        "PositionClosure": 45,
        "PieceTrade": 35,
        "KingAttack": 10,
        "Profilaxis": 50,
        "PositionalSacrifice": 10,
        "KnightVsBishop": 5,
        "PawnPush": 20,
        "OpenFileControl": 25
    },
    "explanation": {
        "Aggressiveness": "Karpov played with precision and control, avoiding unnecessary aggression.",
        "RiskTaking": "He preferred solid and safe play, minimizing risky moves.",
        "KingSafety": "His defensive skills ensured his king was always well-protected.",
        "PieceActivity": "His pieces were optimally placed, but he prioritized stability over constant activity.",
        "PawnStructure": "Karpov valued pawn structure, using it as a key element in his strategic play.",
        "KnightPair": "He maneuvered knights effectively but did not overly rely on them.",
        "BishopPair": "Bishops were important in his positional play, but he did not always favor them over knights.",
        "Defense": "His defensive skills were exceptional, neutralizing opponent threats efficiently.",
        "CalculationDepth": "He calculated deeply when necessary, but relied more on strategic intuition.",
        "EndgameKnowledge": "His endgame technique was outstanding, often squeezing wins from minimal advantages.",
        "PieceSacrifice": "Sacrifices were rare and only played when absolutely necessary.",
        "CenterControl": "Karpov controlled the center methodically, restricting opponent counterplay.",
        "PositionClosure": "He often steered the game toward closed positions to outmaneuver his opponents.",
        "PieceTrade": "He willingly traded pieces to enter favorable endgames.",
        "KingAttack": "Direct attacks on the king were rare, as he preferred positional play.",
        "Profilaxis": "His most famous strength—constantly preventing opponent's plans.",
        "PositionalSacrifice": "Occasional sacrifices were made for long-term positional advantages.",
        "KnightVsBishop": "He used both pieces effectively, adjusting to the needs of the position.",
        "PawnPush": "Pawn advances were well-timed, often restricting opponent mobility.",
        "OpenFileControl": "He used open files when necessary but did not rely on them excessively."
    },
    "loss_streak": 0
}
